<a href="https://colab.research.google.com/github/Oreoluwa99/demo_test/blob/main/Iteration_Over_Rows_Ustacky_Microdegree.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import time

In [3]:
from google.colab import files
uploaded = files.upload()

Saving students - students.csv to students - students.csv

In [4]:
df = pd.read_csv('students - students.csv')

In [7]:
dff = df.iloc[0:5, 0:3]

In [11]:
dff

               name  age       sport
0  Emmanuel Ayomide   27    Football
1      Ibrahim Musa   24    Football
2         Sesan Obi   24    Swimming
3       Kevin Frank   25      Tennis
4        Emeka Jude   24  Basketball

In [17]:
#We'll make use of the for loop to check out and return results for each row

start= time.time() #This records the time before it the code started running

for row_label, row in dff.iterrows():
  print(row_label, row, sep='\n', end='\n')
print('Total time is {}'.format(time.time()-start))

0
name     Emmanuel Ayomide
age                    27
sport            Football
Name: 0, dtype: object
1
name     Ibrahim Musa
age                24
sport        Football
Name: 1, dtype: object
2
name     Sesan Obi
age             24
sport     Swimming
Name: 2, dtype: object
3
name     Kevin Frank
age               25
sport         Tennis
Name: 3, dtype: object
4
name     Emeka Jude
age              24
sport    Basketball
Name: 4, dtype: object
Total time is 0.007578611373901367

In [18]:
#Executing for iterturples

#We'll make use of the for loop to check out and return results for each row

start= time.time() #This records the time before it the code started running

for row in dff.itertuples():
  print(row_label, row, sep='\n', end='\n')
print('Total time is {}'.format(time.time()-start))

4
Pandas(Index=0, name='Emmanuel Ayomide', age=27, sport='Football')
4
Pandas(Index=1, name='Ibrahim Musa', age=24, sport='Football')
4
Pandas(Index=2, name='Sesan Obi', age=24, sport='Swimming')
4
Pandas(Index=3, name='Kevin Frank', age=25, sport='Tennis')
4
Pandas(Index=4, name='Emeka Jude', age=24, sport='Basketball')
Total time is 0.004667043685913086

In [19]:
#Checking with the whole dataset and not just the chunk now

#We'll make use of the for loop to check out and return results for each row

start= time.time() #This records the time before it the code started running

for row_label, row in df.iterrows():
  print(row_label, row, sep='\n', end='\n')
print('Total time is {}'.format(time.time()-start))

0
name             Emmanuel Ayomide
age                            27
sport                    Football
Biology_score                  73
Maths_score                    58
English_score                  65
Name: 0, dtype: object
1
name             Ibrahim Musa
age                        24
sport                Football
Biology_score              92
Maths_score                56
English_score              80
Name: 1, dtype: object
2
name             Sesan Obi
age                     24
sport             Swimming
Biology_score           67
Maths_score             95
English_score           71
Name: 2, dtype: object
3
name             Kevin Frank
age                       25
sport                 Tennis
Biology_score             53
Maths_score               85
English_score             74
Name: 3, dtype: object
4
name             Emeka Jude
age                      24
sport            Basketball
Biology_score            86
Maths_score              80
English_score            93
Name: 4, dtype: object
5
name             Caroline Obi
age                        27
sport              Basketball
Biology_score              92
Maths_score                71
English_score              79
Name: 5, dtype: object
6
name             Franklin Oladele
age                            18
sport                    Football
Biology_score                  96
Maths_score                   NaN
English_score                  70
Name: 6, dtype: object
7
name             Kola Ola
age                    28
sport            Swimming
Biology_score          82
Maths_score            95
English_score          58
Name: 7, dtype: object
8
name             Emmanuel Ovi
age                        23
sport                  Tennis
Biology_score              79
Maths_score                61
English_score              68
Name: 8, dtype: object
9
name             Kareem Musa
age                       24
sport               Football
Biology_score             78
Maths_score               73
English_score             86
Name: 9, dtype: object
10
name             Mustapha Ahmed
age                          24
sport                       NaN
Biology_score                88
Maths_score                  84
English_score               NaN
Name: 10, dtype: object
11
name             Femi Akin
age                     24
sport               Tennis
Biology_score           90
Maths_score             97
English_score           85
Name: 11, dtype: object
12
name             Tobi Olaniyan
age                         22
sport               Volleyball
Biology_score               51
Maths_score                 79
English_score               84
Name: 12, dtype: object
13
name             Kayode Ibrahim
age                          25
sport                  Football
Biology_score                58
Maths_score                  67
English_score                84
Name: 13, dtype: object
14
name             Nnamdi Ike
age                      26
sport              Swimming
Biology_score           NaN
Maths_score              62
English_score            88
Name: 14, dtype: object
15
name             Ahmed Musa
age                      24
sport              Football
Biology_score            60
Maths_score              90
English_score            81
Name: 15, dtype: object
16
name             Kevin Frank
age                       25
sport                 Tennis
Biology_score             53
Maths_score               85
English_score             74
Name: 16, dtype: object
17
name             Susan James
age                       27
sport             Volleyball
Biology_score             76
Maths_score               69
English_score             54
Name: 17, dtype: object
18
name             Zainab Mohammed
age                           25
sport                 Basketball
Biology_score                 64
Maths_score                   95
English_score                 94
Name: 18, dtype: object
19
name             Sesan Obi
age                     26
sport             Swimming
Biology_score           67
Maths_score             95
English_score           71
Name: 19, dtype: object
Total time is 0.03170442581176758

In [20]:
#We'll make use of the for loop to check out and return results for each row

start= time.time() #This records the time before it the code started running

for row in dff.itertuples():
  print(row_label, row, sep='\n', end='\n')
print('Total time is {}'.format(time.time()-start))

19
Pandas(Index=0, name='Emmanuel Ayomide', age=27, sport='Football')
19
Pandas(Index=1, name='Ibrahim Musa', age=24, sport='Football')
19
Pandas(Index=2, name='Sesan Obi', age=24, sport='Swimming')
19
Pandas(Index=3, name='Kevin Frank', age=25, sport='Tennis')
19
Pandas(Index=4, name='Emeka Jude', age=24, sport='Basketball')
Total time is 0.008860111236572266

In [ ]:





#Iterating over pandas dataframe columns now

In [21]:
dff

               name  age       sport
0  Emmanuel Ayomide   27    Football
1      Ibrahim Musa   24    Football
2         Sesan Obi   24    Swimming
3       Kevin Frank   25      Tennis
4        Emeka Jude   24  Basketball

In [23]:
for col_label, col in dff.iteritems():
  print(col_label, col, sep='\n', end='\n')

name
0    Emmanuel Ayomide
1        Ibrahim Musa
2           Sesan Obi
3         Kevin Frank
4          Emeka Jude
Name: name, dtype: object
age
0    27
1    24
2    24
3    25
4    24
Name: age, dtype: int64
sport
0      Football
1      Football
2      Swimming
3        Tennis
4    Basketball
Name: sport, dtype: object

In [24]:
#.item could also work just fine
for col_label, col in dff.items():
  print(col_label, col, sep='\n', end='\n')

name
0    Emmanuel Ayomide
1        Ibrahim Musa
2           Sesan Obi
3         Kevin Frank
4          Emeka Jude
Name: name, dtype: object
age
0    27
1    24
2    24
3    25
4    24
Name: age, dtype: int64
sport
0      Football
1      Football
2      Swimming
3        Tennis
4    Basketball
Name: sport, dtype: object